///////////////////////////////////////////////////////////////////////////////
// FileName:    Version.h
// Created:     2009/04/10
// Author:      titilima
// CopyRight:   Titi Studio (?) 2001-2009
//-----------------------------------------------------------------------------
// Information: Version Informations
///////////////////////////////////////////////////////////////////////////////

#pragma once

#define BIN2TXT_VER         2.1.0.4
#define BIN2TXT_RCVER       2,1,0,4
#define BIN2TXT_VERSTR      "2.1.0.4"
#define BIN2TXT_RCVERSTR    "2,1,0,4"

#define BIN2TXT_WNDCAPTION  _T("bin2txt v")##_T(BIN2TXT_VERSTR)

///////////////////////////////////////////////////////////////////////////////
// 升级记录
// v2.01.003 - 2009.05
//           * 将 lua 解释器整合到可执行文件中。
//           * 加入用户配置，保存上次操作的脚本。
// v2.00.002 - 2009.04.10
//           * 支持 lua 脚本处理。
//           * 不再对输入文件的大小做限制。
//           * 大幅提高了处理速度。
// v1.00.000 - 2009.04.09
//           * 在网友 Huang Yisong 的帮助下找到了 v1.00 的原始版本，重新发布。 
// v1.00.000 - 2003.11.04
//           * 发布。 
///////////////////////////////////////////////////////////////////////////////
